// Однострочный комментарий в JS
/*
  Многострочный комментарий в JS
*/
// JS чувствителен к регистру (JavaScript и javascript, разные переменные)
alert("Окно"); // создает окно сообщения
document.write('Привет!') // выводит результат в HTML документ
document.write('<h1>Привет!</h1>') // также можно использовать HTML-разметку
console.log('Привет!'); // выводит результат в консоль браузера
/*
  Правила наименования переменных:

  - Первым символом должна быть буква, нижнее подчеркивание (_) или знак доллара ($). Следующими символами могут быть буквы, цифры, нижние подчеркивания или знаки доллара;
  - Названия переменных не могут содержать математические или логические операторы;
  - Не должны содержать пробелы;
  - Без спец. символов (#, % и т.д.)
*/
var x = 100; // объявление переменной
document.write(x);
console.log(x);
// дальше типы данных
